#+LATEX_CLASS: book
#+LATEX_HEADER: \usepackage{proof}
#+AUTHOR: Clarissa Littler
#+TITLE: Introduction to Computer Science in Javascript
#+OPTIONS: toc:nil

:META:
 starting words 14183
:END:
      
** First Steps
 The /very/ first piece of syntax we're going to introduce in Javascript is how to print out values within a program. 

 Write the following lines of code in a file called ~FirstSteps.js~.
 #+BEGIN_SRC js :exports code :results output :tangle FirstSteps.js
   console.log(10);
   console.log(100);
   console.log(300);
 #+END_SRC

 #+RESULTS:
 : 10
 : 100
 : 300

If you run this file using the following command you should see the output indicated.
#+BEGIN_SRC sh :exports both :results output
  node FirstSteps.js
#+END_SRC

#+RESULTS:
: 10
: 100
: 300

We need to discuss what's happened here. First off, we've introduced the syntax ~console.log(v)~, whose semantics is to print out to the console the value of its argument, this means that it prints out the result of Javascript evaluating ~v~ and not just the literal syntax of ~v~ as we'll see shortly. This will be very useful for us in testing out our programs and checking that we understand the semantics of our constructs.

The second piece of syntax we've implicitly introduced is the /semi-colon/ and the /line break/. Javascript separates its syntax into /statements/ and /expressions/. We'll make more clear what the distinction between these two, but at first let's just say that statements are things that are separated by lines and expressions are things that can be fed as arguments. So, for example, ~10~ and ~console.log(10)~ are expressions but ~console.log(10);~ is a statement. We can run a series of statements by separting them as new lines in the program. Some other languages that use semicolons are Java, C, C++, C#, and PHP. The use of semicolons is one of those historic conventions that's good for the person writing the implementation of the programming language, but less so for the programmers who need to work in that language. As such, Python doesn't use the semicolon convention and instead just uses linebreaks and indentation to naturally divide code. Going back to our analogy about recipes, think of an expression as a thing like "a cup of flour" or "six onions" but a /statement/ is a step in the recipe such as "sautee six onions until soft". So in the example above each line that has ~console.log(v);~ in it is a separate statement that is executed in order, just like you'd execute the steps of a recipe in order. 

Now that we have a way to print out values and are starting to understand the difference between expressions and statements, we can start introducing operations on numbers as a first step. We have in Python all the basic operations you're familiar with, including +,*, and -. We can see how they work in the following code, which you can copy into a file called ArithmeticExpressions.js

#+BEGIN_SRC js :exports code :results output  :tangle ArithmeticExpressions.js
  console.log(10 + 10)
  console.log(10 * 10)
  console.log(10 - 10)
  console.log(10 / 10)
#+END_SRC

#+RESULTS:
: 20
: 100
: 0
: 1

If you run this code with the following snippet then you should see the same results as below.

#+BEGIN_SRC sh :exports both :results output
  node ArithmeticExpressions.js
#+END_SRC

#+RESULTS:
: 20
: 100
: 0
: 1

It's important to note that the number that's printed out is the /result/ of the expression that's passed into the ~console.log~. 
** Strings
   An important kind of data in programming languages, other than numbers, are pieces of text. There are a few reasons for this. First, that we want our programs to be able to meaningfully communicate with us. We want to be able to get error messages if something goes wrong, we want to be able to send each other emails, etc. Another very important reason is that we want to be able to run our programs! Any program is, in fact, a piece of text. If we want to run our programs, first we need to read in the text of the program and then do something with it. This process of "running" a program from a piece of text is called "interpreting" it. In everyday life, strings are one of those types of data that we transparently use all the time: after all, every piece of writing is an example of a "string". 

 Historically these pieces of text are called strings. In Javascript, as in most languages, strings are designated by quotation marks. So while you can't say ~console.log(This is not a string)~ without getting an error, you can say ~console.log("This is totally a string")~ and have it work fine. We use quotation marks to designate strings so that the computer can tell the difference between literal text and text that's Javascript syntax. This is analogous to how, in English, we make distinctions between "between" and the use of "between", as in this very sentence.
 
 We'll say a few things about writing strings in Javascript and operations on them because there's a lot of little details that you'll end up needing over the course of this text. First off, as we've said a basic string is simply the text between two quotation marks as in this code:
#+BEGIN_SRC js :exports both :results output
  console.log("This is a string")
#+END_SRC

#+RESULTS:
: This is a string

and by running this code we can see that it does exactly what is expected. What if we want a message that stretches across multiple lines? We could just have multiple calls to ~console.log~ but that's not every elegant
#+BEGIN_SRC js :exports both :results output
  console.log("A message that spans")
  console.log("multiple lines")
#+END_SRC

#+RESULTS:
: A message that spans
: multiple lines

since it's a property of the /message/ that it has linebreaks not just of how it's printed. We can include the linebreaks within the string using special /escaped/ characters like so
#+BEGIN_SRC js :exports both :results output
  console.log("A message that spans\nmultiple lines")
#+END_SRC

#+RESULTS:
: A message that spans
: multiple lines

In this case the ~\n~ is a special newline character that tells ~console.log~ function that here, indeed, is a linebreak. We can also include quotation marks within a string by escaping them as well.

#+BEGIN_SRC js :exports both :results output
  console.log("Here's a message that \"has quotes\"")
#+END_SRC

#+RESULTS:
: Here's a message that "has quotes"
Escaping characters is a trick that essentially every programming language uses in order to allow the programmer to format their messages in a readable way. 

There's an easier way to quote things within strings, however, that's somewhat unusual to Javascript: the interchangeable use of ' and ". Much like you would use nested quotations in English, you can say something like 

#+BEGIN_SRC js :exports both :results output
  console.log('this is a string "that uses quotes in it"')
#+END_SRC

#+RESULTS:
: this is a string "that uses quotes in it"

Conversely, if you want to use single quotes then the following works just fine:
#+BEGIN_SRC js :exports both :results output
  console.log("this is a string 'that uses single quotes in it'")
#+END_SRC

#+RESULTS:
: this is a string 'that uses single quotes in it'

Finally, we need to discuss some of the operations on strings. First, we can /concatenate/, or glue, them together with the ~+~ symbol.

#+BEGIN_SRC js :exports both :results output
  console.log("this string" + " is broken" + " into multiple pieces")
#+END_SRC

#+RESULTS:
: this string is broken into multiple pieces

We can also access parts of strings using ~.slice(start,end)~
#+BEGIN_SRC js :exports both :results output
  console.log("We only want a little piece of this string".slice(8, 21))
#+END_SRC

#+RESULTS:
: want a little

In this case we take everything from the *eighth* character up to, but not including, the *twenty-first* character of the string, starting at zero.

We can also access just a single character of a string using ~[]~
#+BEGIN_SRC js :exports both :results output
  console.log("We just want a single character"[1])
#+END_SRC

#+RESULTS:
: e

in this case we print out just the first character, counting from zero, of the string. 
** Comments
   We would be remiss if we didn't say at least a few words about commenting your code. First off, what we mean by a "comment" is a piece of text that can't influence the running of the program in any way. It's text that can be safely ignored by the computer when it runs the program, but it carries information that is useful to whoever is reading it. The syntax of comments is fairly simple: any line starting with ~//~ is a comment and will be ignored
#+BEGIN_SRC js :exports both :results output
  // these lines are just
  // comments that can be
  // ignored and it doesn't matter what
  // I write here
  // console.log(10)

  console.log(30);
#+END_SRC

#+RESULTS:
: 30

running this example we can see that the ~console.log(10)~ was completely ignored. 

Commenting your code is important not just so that others can read the code and understand what it does, but also because *you* need to be able to read your own code in the future and remember what you were trying to do. Comments are useful in outlining the specification of the code, explaining exactly what it's supposed to do and how it's supposed to work. Code without comments is like driving directions without the destination written down. Technically you can use it to get somewhere, but you really want to know where you're going before you start driving. 
** Function Calls and Declarations				      :tofix:
  Now we know how to write simple sequences of statements and perform basic arithmetic operations. The next step will be to explain how to define and use functions. Recalling how we define functions in algebra as 
#+BEGIN_LaTeX
  \[
    f(x) := 10 + x
  \]
#+END_LaTeX
we can see that the fundamental pieces of how functions are declared are
  + the function is given a name
  + the arguments to the function are given names
  + the body of the function is given

We'll start by showing the syntax of defining a function and then we'll show what pieces of syntax correspond to each of these three things. 

#+BEGIN_SRC js :exports code :results output :tangle FirstFunction.js
  function function1 (x) {
      console.log(x);
      console.log(x);
  }

  function1(10);
#+END_SRC

#+RESULTS:
: 10
: 10

and put that code in FirstFunction.js

Now if we go ahead and put this code in a file and run it 
#+BEGIN_SRC sh :exports both :results output
  node FirstFunction.js
#+END_SRC

#+RESULTS:
: 10
: 10

we should see that when the function ~function1~ is called with the argument ~10~ then it prints ~10~ twice. Looking at the /definition/ of the function we can see that we defined it by having the keyword ~function~, then the /name/ we were giving to the function, then the name of the /argument/ to the function, followed by a *sequence of statements*. This sequence of statements is what we call the /body/ of the function. This is the first piece of the language where see the pattern of wrapping a sequence of statements in a pair of ~{}~ braces. Languages such as Javascript use braces to make it easy for the implementation to tell if the statements that come after the function definition are all a part of the body of the function or code that comes after the function definition. 

For example, with no syntactic indicators of where a function body ends then it's ambiguous whether a piece of code such as
#+BEGIN_SRC js :exports code

#+END_SRC

There's a couple of things we haven't explained about functions in Python yet. First, we're used to a function /returning a value/ after it's called. Our earlier example function would return 20 when passed 10. Let us check what the value of our function after it's called is.
#+BEGIN_SRC python :exports both :results output :session fun
  print(function1(10))
#+END_SRC

#+RESULTS:
: 10
: 10
: None

Notice that the final value returned was ~None~. ~None~ is actually a special value in Python that means that there was no data. In order to make our function /return/ a value we need to use the ~return~ keyword as follows

#+BEGIN_SRC python :exports both :results output 
  def function2(x):
      return 10 + x

  print(function2(10))
#+END_SRC

#+RESULTS:
: 20

Now this actually corresponds to our function 
#+BEGIN_LaTeX
  \[
    f(x) := x + 10
  \]
#+END_LaTeX

In summary, 
  + functions in Python are defined with
    + the keyword ~def~
    + the name of the function
    + its arguments, separated by commas just like in high school algebra
    + the body of the function as an indented sequence of statements
  + a Python function always returns a value
    + if you don't specify /what/ value then it will return ~None~
    + you can specify what value it returns with ~return~
  function function1 (x)
  console.log(x);
  console.log(x);

  function1(10);
** Functions as Values						      :tofix:
   One thing that may not have been obvious yet in Python is that /functions/ are just another value, like numbers or lists or strings. We can pass functions into other functions like the following fairly silly example 
#+BEGIN_SRC python :exports code :results output
  def doublefun(function,argument):
      return (function(function(argument)))

  def sillyfunction(x):
      return 2*x

  print(doublefun(sillyfunction,10))
#+END_SRC

#+RESULTS:
: 40

which should print out the number ~40~ at the end of the code. Now, how did it get the number 40? The definition of ~doublefun~ takes in two arguments, a /function/ and an argument to /pass/ the function. We then call the function twice on the provided argument, so when we pass in ~sillyfunction~ as our function argument then we can roughly see the progression of the code as
#+BEGIN_EXAMPLE
print(doublefun(sillyfunction,10)) -->
v = sillyfunction(sillyfunction(10))
print(v) -->
v = sillyfunction(2*10)
print(v) -->
v = sillyfunction(20)
print(v) -->
v = 2*20
print(v) -->
print(40)
#+END_EXAMPLE
:META:
 This really needs to be cleaned up, but I'm trying to experiment here with how to actually write all of this stuff.  
:END:
When taken apart it's probably less intimidating than it seems at first, but we simply are able to 
** More on Numbers						      :tofix:
   So far we've just been dealing with natural numbers in our examples, but Python can handle other kinds of numbers than that and actually has a large number of operations on numbers. We can use a small subset of the real numbers, called the floating point numbers, as well. 

   For example if we take the square root of 2 we'll get 
#+BEGIN_SRC python :exports both :results output
  print(2**0.5)
#+END_SRC

#+RESULTS:
: 1.41421356237

Now the square root of 2 has an /infinite/ decimal expansion, so technically speaking this isn't the square root but a close approximation of it. In general the /real/ numbers as we've seen them in mathematics can't be completely described by a computer because they may have infinitely many decimal places. 
** Booleans							      :tofix:
   There are a few more pieces that we need to deal with before we can actually start showing what real programs look like. In this section we'll talk about a kind of data called /booleans/ and how they can be used to make choices in a program.
   
   We're all familiar with making decisions based upon whether or not some /condition/ is true. For example, you leave the brownies in the oven *until* a toothpick comes out clean. If the game costs *less* than $20, then you know you can buy it, but if it's over $20 then you have to pass on it. If you're *over* 21, then you don't have to use a fake ID to get a beer, but if you're under 21 then you probably shouldn't break the law. 

   The common thing in all of these is that /if/ something is true, then you perform an action, and if it's not true you perform a different action. 

   In order to describe using these kinds of conditions in programming, we need a kind of data that corresponds to something being /true/ or /false. In Python, as in most programming languages, this is called a Boolean. There are only two Booleans, called ~True~ and ~False~.

  In order to actually /make/ a choice based upon a condition, we introduce another piece of syntax: the if-statement.

  Here's an example of an if-statement
#+BEGIN_SRC python :exports both :results output
  if True:
      print(True)
  else:
      print(False)
#+END_SRC

#+RESULTS:
: True
This is a very /trivial/ if-statement but it gives us the basic syntax since all if-statements must have the following form
#+BEGIN_SRC python :exports code
  if condition:
      sequence of statements
  else:
      another sequence of statements
#+END_SRC
Similarly to function bodies, we have an /indented/ sequence of statements that are the things to do if the condition is ~True~ or if it evaluates to ~False~. Notice, though, that the ~print(False)~ in the ~else~ branch never actually printed anything. Whichever branch of the if-statement the program ends up taking, the other branch will never actually run. 

What if we want to do nothing special if the condition isn't ~True~ and, instead, just keep running the program as normal? In that case, we can leave off the ~else~ part of the if-statement. Consider the following piece of code that uses both functions and if-statements:
#+BEGIN_SRC python :exports both :results output
  def boolFun(b):
      if b:
          print("The if statement ran")
      print("This is after the if statement")

  boolFun(True)
  print("")
  boolFun(False)
#+END_SRC 

#+RESULTS:
: The if statement ran
: This is after the if statement
: 
: This is after the if statement

Now if you look at the output of this code, you can see that it's exactly what we expect. In the first case both of the ~print~ statements run and in the second only the last print statement, outside of the if-statement, runs. 

    If the only thing we could put into conditions of an if-statement were literally ~True~ and ~False~ then they wouldn't be very interesting. In this section we'll talk about some of the built-in operations in Python that are /Boolean-valued/, that is that they return a Boolean. 

    First, we have the basic comparison operations on numbers. There's the basic ~<~, ~>~, ~<=~, and ~>=~. We can see them in the following function

    #+BEGIN_SRC python :exports both :results output
      def usesLessThan(number1, number2):
          if number1 <= number2:
              print("number1 was less than or equal to number2")
          else:
              print("number2 was greater than number1")

      usesLessThan(10,20)
    #+END_SRC

    #+RESULTS:
    : number1 was less than or equal to number2

    We also have the rather important comparison operations ~==~ and ~!=~, which tells us whether or not two things are equal. We can use ~==~ and ~!=~ on any type, and ~==~ will return ~True~ if two things are equal and ~False~ if they are not and ~!=~ does the exact opposite. 

    This means we can do things like 
#+BEGIN_SRC python :exports code :tangle ComparisonExample.py
  number = input("Enter a number:")
  if int(number)==5:
      print("You entered 5")
  else: 
      print("You entered something that wasn't 5'")
#+END_SRC


Finally, we have enough pieces that we can show the last variant we need of the if-statement: the else-if. Consider the following, somewhat poorly structured, code that makes multiple comparisons

#+BEGIN_SRC python :exports code :tangle ComparisonExample2.py
  number = input("Enter a number: ")
  if int(number)==5:
      print "You entered 5"
  else:
      if int(number)==10:
          print "You entered 10"
      else:
          print "You entered something else"
#+END_SRC


If we have to make a new if-statement for each different choice then that means that our code is going to get very unwieldy very quickly.

Instead, we can use the else-if this way
#+BEGIN_SRC python :exports code :tangle ComparisonExample3.py
  number = input("Enter a number: ")
  if int(number)==5:
      print "You entered 5"
  elif int(number)==10:
      print "You entered 10"
  else:
      print "You entered something else"
#+END_SRC

This allows us to be much clearer in the meaning of our code. 
** Lists							      :tofix:
   Another kind of data that's important in Python are /lists/. A list is a sequence of arbitrary things. We can have booleans, numbers, other lists, etc. in our list. An example of a list would be something like
   #+BEGIN_SRC python :exports both :results output
     myFavoriteAlbums = ["Fables From a Mayfly", "Anchors and Arrows", "Random Access Memories"]
     print(myFavoriteAlbums)
   #+END_SRC

   #+RESULTS:
   : ['Fables From a Mayfly', 'Anchors and Arrows', 'Random Access Memories']

A list can be created by including a comma-delimited sequence of expressions between two square brackets. The above is the Python equivalent of the following text

  + "Fables from a Mayfly"
  + "Anchors and Arrows"
  + "Random Access Memories"

Once a list is made, there are obvious things you might want to do with it such as
  + access the n-th memmber of the list
  + change an element of the list
  + add a new item to the list
  + take an item off of the list

The first of those we can do with the following bit of syntax
#+BEGIN_SRC python :exports both :results output 
  myFavoriteAlbums=["Fables From a Mayfly", "Anchors and Arrows", "Random Access Memories"]

  print(myFavoriteAlbums)
  print(myFavoriteAlbums[0])
#+END_SRC

#+RESULTS:
: ['Fables From a Mayfly', 'Anchors and Arrows', 'Random Access Memories']
: Fables From a Mayfly

When we run these print statements we can see that the expression ~myFavoriteAlbums[0]~ pulls out the first element of the list. This tells us that lists are indexed by /0/. This is true in most programming languages, actually, that we start counting at 0 and work our way up, as opposed to informal conversation where we tend to start counting with 1.

Next, we come to changing elements of a list once they're made. We can also do that with the ~[]~ syntax that we've just introduced, as follows.

#+BEGIN_SRC python :exports both :results output
  myFavoriteChickens = ["Beleena", "Nimbus"]
  # oh no, it turns out that I spelled Billina wrong
  myFavoriteChickens[0] = "Billina"
  print(myFavoriteChickens)
#+END_SRC

#+RESULTS:
: ['Billina', 'Nimbus']

We can see that the name of the first chicken in our list has, in fact, changed! The underlying metaphor behind the ~[]~ syntax is that a list isn't just a list-of-things, it's actually a list-of-containers. You can actually change what's in those containers without even making a whole new list. Now, that's useful now but we'll also see situations where that can be slightly dangerous if we're not careful on how we treat these containers. If it helps, thinking of how you would write a bulleted list by hand: when you decide to change one of the entries in the list, you don't also erase the bullet point rather just the text next to the bullet point, i.e. the contents of the container as opposed to the container itself. 

Can we modify random points in a list? What if we try accessing or modifying large indexes? Try running the following pieces of code 
#+BEGIN_SRC python :exports both :results output 
  myFavoriteChickens = ["Billina", "Nimbus"]

  print(myFavoriteChickens[10])
#+END_SRC

then we'll get the output
#+BEGIN_EXAMPLE
Traceback (most recent call last):
  File "<stdin>", line 3, in <module>
IndexError: list index out of range
#+END_EXAMPLE
which means that we're not allowed to access further than end of the list. 

There are a few ways to add items to a list. The first one is the ~.append~ method, which conceptually corresponds to adding a new thing to the /end/ of a list of things. 

#+BEGIN_SRC python :exports both :results output
  myFavoriteAlbums=["Fables From a Mayfly", "Anchors and Arrows", "Random Access Memories"]

  myFavoriteAlbums.append("Fumbling Towards Ecstasy")
  print(myFavoriteAlbums)
#+END_SRC

#+RESULTS:
: ['Fables From a Mayfly', 'Anchors and Arrows', 'Random Access Memories', 'Fumbling Towards Ecstasy']

Here we've introduced a new piece of syntax: the method call. Methods are /like/ functions, but they're attached to a particular kinda of data. In this case, the ~append~ method is attached to lists themselves and can't be used on just anything. Indeed, if you were to try to ~.append~ something to a number you'd get an error like this snippet of a Python session

#+BEGIN_EXAMPLE
>>> x = 10
>>> x.append("a thing to append")
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
AttributeError: 'int' object has no attribute 'append'
#+END_EXAMPLE

Methods are all called with the ~.~ syntax, where the name of the method being called comes /after/ the ~.~ but otherwise the syntax behaves the same as functions.

If you can add to the list, you'd expect that you can also take away from the list. We can remove elements from the list a few different ways. The first is the ~pop~ method, which removes an item from the end of the list. By "remove" here we mean that it completely removes the /container/ at the end of the list. 

#+BEGIN_SRC python :exports both :results output
  myList = [1,2,3]
  myList.pop()
  print(myList)
#+END_SRC

#+RESULTS:
: [1, 2]

Continuing our metaphor of lists as pen-and-paper lists, using ~.pop~ corresponds to erasing the entire bullet point at the end of the list. Not just the data is gone, but the entire place for it is gone. 

*** While Loops
A typical while-statement will look like
#+BEGIN_SRC python :results output :exports both :tangle FirstWhile.py
  x = 0
  while x < 10:
      print("Still running")
      x = x + 1
#+END_SRC

#+RESULTS:
#+begin_example
Still running
Still running
Still running
Still running
Still running
Still running
Still running
Still running
Still running
Still running
#+end_example

We see again the typical pattern that one of these special statement forms starts with a keyword, in this case ~while~, some extra information after the keyword, which in this case is the condition to /keep/ running, a ~:~ and then the sequence of statements that should run.

In words, what this code means is that we start with the variable ~x~ be set to ~0~ and, then, every time the body of the while-statement is run it will 
  + print the string "Still running"
  + increment the value of the number held by the container ~x~
and the body will run a total of *10* times, once for ~x=0~, ~x=1~, etc. up through ~x=9~. When ~x=10~ then the condition in the while-statement will return ~False~ and the body of the loop is skipped. 

Here's another example of a while loop, one that involves interactive input
#+BEGIN_SRC python :exports code :tangle WhileAsk.py
  x = input("Enter a string: ")
  while x != "quit":
      print(x)
      x = input("Enter another string: ")
#+END_SRC

this code will keep asking us to enter a string until we give the program the string "quit".

Of course, while loops can be somewhat dangerous since they can potentially run /forever/. For example, if we write a loop such as
#+BEGIN_SRC python :exports code :tangle BadWhile1.py
  while True:
      print("Still running")
#+END_SRC
and attempt to run it, then it will end up running forever. Now, this is a somewhat obviously trivial infinite loop but it's also possible to write infinite loops that are less obviously wrong. Try to figure out what the problem is with this loop before reading on
#+BEGIN_SRC python :exports code :tangle BadWhile2.py
  x = 10
  while (x != 0):
      print("Still running")
      print(x)
      x = x - 3
#+END_SRC

The idea behind this code is fairly straightfoward. Counting down from 10, we want to print all the numbers that are from 10 on down to 1, counting down by 3 each time. The problem with this code, and what you'll see if you attempt to run it, is that it won't actually stop running! 

The reason why is that we hit a state where ~x=1~, then we run the body of the loop again and end with ~x=-2~. Once ~x=-2~, we hit the body of the loop again and then check to see if ~-2 != 0~, which is ~True~, and thus the loop continues. The condition to terminate the loop, that ~x==0~, will never actually happen. In order to fix this loop we'd need to do something like

#+BEGIN_SRC python :exports code :tangle FixedWhile.py
  x = 10
  while (x > 0):
      print("Still running")
      print(x)
      x = x - 3
#+END_SRC
and we can see that this version works exactly as intended. 

*** For Loops
The other kind of loop that exists in Python is the ability to do something for a set number of times. For example, if I need to crack six eggs then for /each/ egg I need to crack it into the bowl. If I need to grade 30 assignments, then for /each/ assignment I need to grade it. These are tasks where there are /items/ in a /collection/ where for /each/ item we /do/ something. Corresponding to this kind of iteration we have for-loops in Python. The basic syntax of a for-loop looks something like 

#+BEGIN_SRC python :exports both :results output
  myFavoriteAlbums=["Fables From a Mayfly", "Anchors and Arrows", "Random Access Memories"]

  for album in myFavoriteAlbums:
      print("I like this: " + album)
#+END_SRC

#+RESULTS:
: I like this: Fables From a Mayfly
: I like this: Anchors and Arrows
: I like this: Random Access Memories

The syntax follows the basic idea that /for/ each item /in/ a collection of things, we perform some sequence of actions. As with all the syntactic forms we've seen before, we follow the ~:~ character with an indented sequence of statements. 

What if, though, we want to do something a particular number of times rather than over a concrete number of things. A real life example would be something like weight training, where you have a particular /number of repetitions/ for some action. We mimic this style of iteration by using the normal for-loop syntax, but with a special kind of list we generate with the ~range~ function. The ~range~ function will return a list of numbers within the specified range, as in the following code
#+BEGIN_SRC python :exports both :results output
  for num in range(10):
      print(num)
#+END_SRC

#+RESULTS:
#+begin_example
0
1
2
3
4
5
6
7
8
9
#+end_example

We can also be more specific by specifying both the top and bottom of the range:

#+BEGIN_SRC python :exports both :results output
  for num in range(5,10):
      print(num)
#+END_SRC

#+RESULTS:
: 5
: 6
: 7
: 8
: 9

Note, though, that this defines an interval of numbers that is /closed/ on the bottom of the range but /open/ on the top of the range. 

**** Unrolling While Loops

#+BEGIN_SRC python :results output :exports both 
  x = 0
  while x < 10:
      print("Still running")
      x = x + 1
#+END_SRC

#+RESULTS:
#+begin_example
Still running
Still running
Still running
Still running
Still running
Still running
Still running
Still running
Still running
Still running
#+end_example

it's actually equivalent to the following piece of code

#+BEGIN_SRC python :results output :exports both
  x = 0
  print("Still running")
  x = x + 1
  while x < 10:
      print("Still running")
      x = x + 1
#+END_SRC

** An Aside on Types and Hidden Errors				      :tofix:
   At this point we've had some exercises, we've introduced a number of kinds of data, and we've seen that there's a basic notion of "type" of data at play here. What this means is that you can't, for example, use a number as a string. Running

#+BEGIN_SRC python :exports none :results output
  print(3[2:5])
#+END_SRC

will result in getting an error ~TypeError: 'int' object is not subscriptable~, which is just a fancy way of saying that numbers aren't in the set of kinds of data that you can use the ~[ ]~ or ~[ : ]~ notation on. Now, of course we only see these errors if we actually run /the/ line of code that has the problem. For example, in the following file we'll never actually hit an error

#+BEGIN_SRC python :exports both :results output
  if False:
      print(3[2:5])
  else:
      print("This is okay!")
#+END_SRC

#+RESULTS:
: This is okay!

when we run the code, but what if something changes and our conditional stops being false? Then we'll hit the error without having realized it. The same thing is true for the following program, which defines a function that has a type error in it but doesn't use it /yet/

#+BEGIN_SRC python :exports both :results output

#+END_SRC

The point of all these examples is that just because a Python program runs the first time doesn't mean that it's actually error free. This is because Python is an "untyped" language, a language where programs with typing errors are still valid programs in the language. Practically, the difference between a typed and an untyped language is that typed languages have some form of "type checking" phase that rejects a program that has type errors and doesn't allow it to be run. 

What this means for you as a Python programmer is that *you* need to do the actual work of ensuring that your code doesn't contain type errors. It's a good practice to make sure that you include some comments to yourself about the type of data you expect to be passed into functions and to also not /change/ the type of data that a variable holds over the course of the program.  For example, I'd argue that the following program is rather bad style

#+BEGIN_SRC python :exports both :results output
  myDictionary = {}

  def myFun(d): 
#+END_SRC

because we're trying to be "cute" and save space by 
** More On Input and Output					      :tofix:
We've shown that we can print out data, but what about taking /in/ data? We can do that with the input command as follows, giving us a chance to also show how variables work as well. Go ahead and put this code in a file called ~InputExample.py~ and run it. 
#+BEGIN_SRC python :exports code :tangle InputExample.py
  x = input("Enter a string:")
  print(x)
#+END_SRC
You should see a prompt in the console that says "Enter a string:" and then if you enter a number at the prompt it should look something like
#+BEGIN_EXAMPLE
python InputExample.py 
Enter a string:10
10
#+END_EXAMPLE

Now, ~input~ reads a /string/ from input. Even if it looks like you're entering in a number, Python is going to treat this as "10" and not 10. In order to turn a string into a number, we need to use the ~int~ function that performs this conversion.

There's also a slightly more convenient syntax for using the ~print~ function that allows us to merge multiple things together in output

#+BEGIN_SRC python :exports both :results output 
  print("This is","a string","broken into pieces")
#+END_SRC

#+RESULTS:
: This is a string broken into pieces

Note that each comma separated pieces ends up being separated by a space in the output of the string. We can also put arbitrary values into the sequence of prints as in
#+BEGIN_SRC python :exports both :results output
  print "This should print 10:",5 + 5,"But did it?"
#+END_SRC

#+RESULTS:
: This should print 10: 10 But did it?

That output looks a little ugly and we /could/ just add a new print line like this
#+BEGIN_SRC python :exports both :results output
  print "This should print 10:",5+5
  print "But did it?"
#+END_SRC
but we can also use the newline character "\n" within a string, which tells the ~print~ statement to make a new line.
#+BEGIN_SRC python :exports both :results output
  print "This should print 10:",5+5,"\nBut did it?"
#+END_SRC

#+RESULTS:
: This should print 10: 10 
: But did it?

** Anonymous Functions
   To this point we've been dealing with functions as declarations, and in Python that's the main way that they're used. At the same time, there's another limited way in which we can define functions with /expressions/ rather statements. These are the so-called anonymous---that is, unnamed---functions, also called lambda functions. Here's a quick example of making a function that squares a number 
   #+BEGIN_SRC python :exports both :results output
     sqr = lambda n: n*n

     print(sqr(10)) # should print 100!
   #+END_SRC

   #+RESULTS:
   : 100

The syntax of this is a little bit different than normal function definitions. The basic differences are below:

   + lambda expressions can't use statements. The body of a lambda is allowed to be a /single/ expression.
   + Because lambda expressions have only a single expression, there's no ~return~ statement needed. A function built from a lambda expression returns the value of this /single/ expression
   + A lambda expression can be directly passed in as an argument

Now, why do we care about this? We already have "first class" functions in Python: we can pass functions by name to other functions, we can assign functions to variables, we can /return/ functions like any other value. In Python, lambda expressions are mostly a matter of convenience. Sometimes you don't need or even want to name a function because naming a function takes up a perfectly good name and is simply more work. For example, what if we wanted to operate on all the possible 
** Objects
   At this point, we've shown that we can do an awful lot with just the kinds of data that are built into Python but, of course, that's not all we're going to want to do. We'll need to "package up" data into collections. For example, if we were writing even a small video game it would start becoming incredibly unwieldly to store the state of the game as a giant tuple of other tuples, lists, and dictionaries. We'd end up repeating a lot of code in order to try and access and modify data in the ways that we want. 

   Instead, what we need to be able to do is make new /kinds/ of data that package up the information that we need /as well as/ the ways that we're allowed to work with this data. Consider lists, for example. Lists contain certain data within them, but you can only access it in the ways that the list /allows/ you to do. Adding an element to the end of the list had to be done using the operations defined, such as the ~append~ method. You can't simply "open up" the list and see how it is actually represented internally to Python. This combination of data store and control over how that data can be accessed is what is accomplished by the object system of Python. 

A little bit of terminology first, though, in that there's a distinction between a /class/ and an /object/. A particular list is an /object/, but the kind of object it is is a /class/. So when we declare new kinds of objects, we're actually declaring a class that we can use to make objects. 

  At this point some examples are in order. Here's the declaration for a class that will make objects that have a /single/ piece of data that we can access. 

#+BEGIN_SRC python :results output :exports both
  class FirstClass: 
      def __init__(self):
         self.attribute = 10

  y = FirstClass()
  print(y.attribute)
#+END_SRC

#+RESULTS:
: 10

Picking apart what this syntax means, we are declaring first the /name/ of our class, which is FirstClass, and then defining a very special function called ~__init__~. This function plays the special role of telling the Python implementation how to make an object from the class definition ~FirstClass~. The ~__init__~ function takes, as a special argument, the argument ~self~. ~self~ functions as a stand in for the object that's being made. Here, we can use the ~.~ syntax to not just modify attributes that already exist but to /define/ what attributes objects made from this class have. For example, the following code will throw an error if you run it
#+BEGIN_SRC python :results output :exports both
  class FirstClass:
      def __init__(self):
          return None

  y = FirstClass()
  y.attribute = 10
  print(y.attribute)
#+END_SRC

#+RESULTS:
: 10

